gatling/resources/data/Soap_request_GetEventList.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.wizards.com/Service/2013-03">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:GetEventList>
         <ns:request>
            <ns:AuthToken>${access_token}</ns:AuthToken>
            <ns:LastSyncDate>2019-06-28T09:33:00</ns:LastSyncDate>
         </ns:request>
      </ns:GetEventList>
   </soapenv:Body>
</soapenv:Envelope>